app/views/articles/index.html.erb

                                <i class="fas fa-heart"></i>
                            <%=t.article_likes.count%>
---
SELECT `articles`.* FROM `articles`
SELECT COUNT(*) FROM `articles`

                                <i class="far fa-heart"></i>
                            <%=t.article_likes.count%>
---
SELECT COUNT(*) FROM `articles`