app/controllers/articles_controller.rb

  def index
    if params[:search] == nil
      @articles = Article.all.page(params[:page]).per(10)
---
SELECT `articles`.* FROM `articles` LIMIT 11