app/controllers/articles_controller.rb

  def index
    @articles = Article.all.page(params[:page]).per(5)
---
SELECT COUNT(*) FROM `articles`
SELECT `articles`.* FROM `articles`

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO `articles` (`category`, `title`, `content`, `to_join`, `skill`, `created_at`, `updated_at`) VALUES ('HELP', 'fff', 'aaaaagshgs\r\nbs\r\ng\r\nbs\r\n\r\ns\r\n\r\ng\r\ns\r\nhgwr\r\n', 'aaaaagavc\r\nfaghtha\r\nh\r\nsthbsrth\r\nbsrb\r\ns\r\nbsrthsrb\r\ns\r\n', 'agargaerga\r\nbsbn\r\nbs\r\ngbs\r\nbs\r\nb\r\nsb\r\ns\r\nbsbrg', '2020-09-25 02:52:04.499280', '2020-09-25 02:52:04.499280')